
character[101] = "贾藻"
profile[101] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[101] = 1;

character[102] = "贾蘅"
profile[102] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[102] = 1;

character[103] = "贾芬"
profile[103] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[103] = 1;

character[104] = "贾芳"
profile[104] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[104] = 1;

character[105] = "贾芝"
profile[105] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[105] = 1;

character[106] = "贾璎"
profile[106] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[106] = 1;

character[107] = "贾环"
profile[107] = "姓贾的人里面终于遇着个有两句话说的了。这贾环是个不争气的主，也是个倒霉蛋，好不容易贵妃回来省亲一次，他还病了。“人物委琐，举止荒疏”这是他给贾政的印象，他给人印象深的都不是什么好事，象什么赌输了赖莺儿的钱；故意泼蜡油烧伤宝玉；在贾政面前告宝玉的状；猜不出贵妃的谜语，出的谜语也不通；蔷薇硝事件的参与者之一；狗咬吕洞宾，歪派彩云；彩霞对他如此只好，他也不放在心上，彩霞被放出去，他却想将来还会有好的，可见是个无情的人，唉，通篇看来，竟然找不到有什么地方说他好的。我一向是个异己分子，别人说好的，我偏要找找毛病，别人说不好的，我肯定会找找优点，可是这贾环还真为难我了，前前后后我将有关他的文字看了好几遍了，就是找不到哪个地方能说他好话。如果按照现代的遗传理论来说，这贾环怎么能这样呢？且不说元春和宝玉，就连同父同母的探春和他相比也是天壤之别啊。"
sexflag[107] = 1;

character[108] = "贾代儒"
profile[108] = "“乃当今之老儒”，当时仅存的“代”字辈的两位之一，贾瑞的祖父，对孙子的管教很严，可是管教的方法还值得商酌，你能说贾瑞之死与他一点关系也没有吗？不过对他的同情要多，白发人送黑发人啊，没准还是根独苗，sigh！"
sexflag[108] = 1;
 
character[109] = "贾代善"
profile[109] = "容公的长子，贾赦、贾政之父，当然也是宝玉他爷爷了（废话！不过不说两句废话，实在没的好写的）。发现一个现象：书中“代”字辈的有名字一共有四个，除了代善外，另外三个的名字的第二个字都是单人旁，如代化、代儒和代修。不知曹公这么取名是否有什么用意。"
sexflag[109] = 1;
 
character[110] = "贾代修"
profile[110] = "在世的第二位“代”字辈的，仅此而已，也许是“贾敕、贾效、贾敦”他们某个的父亲也未可知。"
sexflag[110] = 1;

character[111] = "贾璜"
profile[111] = "贾家玉字辈的嫡派，金荣的姑父，“守着些小的产业，又时常到宁荣二府里去请请安，又会奉承凤姐儿并尤氏，所以凤姐儿尤氏也时常资助资助他，”以此度日。所以大概也就是要么闲着要么在贾府打打杂。"
sexflag[111] = 1;

character[112] = "贾敬"
profile[112] = "“代化次子，袭了官，如今一味好道，只爱烧丹炼汞，余者一概不在心上”，生日不回来，孙媳妇死了也不在意。不过他毕竟是荣宁两府的老大，因此祭祖什么的还得由他主持。因为一句“造衅开端实在宁”，就有人考证出贾敬和尤氏有暧昧之事，这我怎么看也看不出来啊。这好像只是本小说，而不是野史，哪能有那么多的故事后面的故事？"
sexflag[112] = 1;
mainflag[112] = 1;

character[113] = "贾菌"
profile[113] = "“系荣府近派的重孙，其母亦少寡”，“志气最大，极是淘气不怕人的”，大闹学堂就有他，也是个唯恐天下不乱的主。跟着他妈去荣府过了一次元宵。"
sexflag[113] = 1;

character[114] = "贾兰"
profile[114] = "这个可是荣府正宗曾孙，“天生的牛心古怪”，据说后来是当了官的，理由嘛，就是“气昂昂头戴簪缨，气昂昂头戴簪缨，光灿灿胸悬金印，威赫赫爵禄高登，威赫赫爵禄高登，昏惨惨黄泉路近。”因为曾经射过鹿，所以很多人都认为他是靠军功才当上官的，我一直不敢想象红楼里的人物驰骋沙场，所以我更愿意相信他是考科举得的功名，可惜啊，死得早了点，否则真是“兰桂齐芳”了。"
sexflag[114] = 1;
mainflag[114] = 1;

character[115] = "贾蓝"
profile[115] = "此蓝不是彼兰，他是个省事的，不多事，不惹事，大闹学堂时，不光自己不闹，还劝贾菌也不要闹，多乖的一孩子，搁现在，肯定是个“三好学生”，呵呵。（上了近20年的学了，我好像就得过那么一两次三好学生，惭愧啊）"
sexflag[115] = 1;

character[116] = "贾琏"
profile[116] = "一典型的纨绔子弟，花花公子，如果说宝玉是意淫，那么琏二爷就是“非意淫”了，呵呵。还是个“气管炎”，可见中国人的“惧内”是有传统的。他的要杀凤姐也只不过是被逼急了，趁酒后接题发挥一下而已。每次看到二姐死后贾琏的熊样，都觉得他的可怜，不过二姐的死和他是脱不了干系的。说到贾琏好的地方，恐怕就是被他爹打了一顿了，总算琏二爷还是个有良心的人，不忍对石呆子下黑手。提到琏二爷，因为这个“二”字，于是有不少红学“家”就动脑筋了，考证出他还有个亲哥哥，我见过的他哥哥的名字就有好几个，什么贾珊、贾瑚了，很多的。可是我不相信他还有什么亲哥哥，至于为什么叫“二爷”呢，我也不知道，霍氏姐弟倒是有个解释，按照他们的逻辑也说得过去。不过他们那套东西谁也不信。所以我的解释就是曹公喜欢用“二爷”这个称呼罢了，还有“柳二爷”、“芸二爷”等等。"
sexflag[116] = 1;
mainflag[116] = 1;

character[117] = "贾菱"
profile[117] = "说说他在书中都干了些什么事吧，首先出场是因为可卿的死；后来修建大观园，他和贾菖一起监工；53回祭祖又是他和贾菖展拜毯；出席荣府元宵夜宴，坐在廊上；贾敬死后，他是执事之一；完了。"
sexflag[117] = 1;

character[118] = "贾敏"
profile[118] = "林公如海之夫人，即荣府中赦、政二公之胞妹，黛玉之母亲，宝玉之姑妈。想象不出她是个什么样的人，多半是个慈爱的母亲、贤惠的妻子。就可惜身子骨不好，竟然一疾而终了。"
 
character[119] = "贾母"
profile[119] = "是贾府的太上皇，也是个享福之人，用刘姥姥的话来说就是“老太太生来是享福的。”吃穿用度不愁，诸事不劳费神、子孙满堂，在家中有绝对的权威,这都是她的有福之处。我一直认为在对待宝玉的婚事上，老太太是向着黛玉的，她也未必就指望宝玉去考取个什么功名，在走过了人生这么长的经历后，她真正懂得开心的活着才是最重要的。"
mainflag[119] = 1;

character[120] = "贾蔷"
profile[120] = "系宁府中之正派玄孙，生的风流俊俏，内性又聪明。“斗鸡走狗，赏花玩柳”不干什么好事一出场就挑唆茗烟大闹学堂，自己却开溜了。紧接着就是和贾蓉配合凤姐整贾瑞。也是在贾府内干事的，还“近水楼台先得月”，获得了龄官的芳心。如果猜测没错的话，龄官应该在解散剧团的时候跟着贾蔷去了，两人从此过着“幸福快乐的生活”（呵呵，受了白雪公主和灰姑娘等故事的影响），否则贾蔷就辜负龄官的一片痴情了。"
mainflag[120] = 1;
sexflag[120] = 1;

character[121] = "贾芹"
profile[121] = "他和荣宁二府的关系大概和贾芸一样，也在凤姐的麾下干事，在城外管理着一帮小和尚和小沙弥，天高皇帝远，于是“夜夜招聚匪类赌钱，养老婆小子”。反正不是一什么好鸟，懒得说他了。"
mainflag[121] = 1;
sexflag[121] = 1;

character[122] = "贾蓉"
profile[122] = "姓“贾”的真不好写，要不就没什么说头，要不就是几句话说不完的，这贾蓉的性格还算单调，不过除了说他是个纨绔子弟还真的说不出什么新鲜的来。在家里管点杂事什么的，一辈子也就这么过了。他在书中的最大的动作莫过于撺掇贾琏娶了尤二姐，为的也是自己和小姨们鬼混的方便。他让红学家们和红迷们讨论得最多莫过于他是不是凤姐养的“小叔子”，赞成者的理由是第6回他来借玻璃炕屏凤姐所表现出来的暧昧态度和后来的让他&贾蔷去整贾瑞，反对者的理由很简单，因为按辈份来说他是凤姐的侄儿而不是小叔子。我是站在反对者一边的，其实我根本就是怀疑养小叔子的不是指的凤姐，这里不多说了。"
mainflag[122] = 1;
sexflag[122] = 1;

character[123] = "贾瑞"
profile[123] = "本想用“哀其不幸，怒其不争”来开头的，可是发现用在这里不合适，怪只怪他长的不够俊美，否则没准凤姐。。。呵呵，此处删除多少多少字，（啊~~，谁扔的臭鸡蛋？）。至于他是谁，不用说了吧。得，既然是素描，还是交代一句吧，贾代儒的孙子，替他爷爷代过课，没想到就有人大闹学堂，想勾搭凤姐，没想到中了她的圈套，丢了小命。可怜，可怜。其实他的另外一个大功劳就是引出“风月宝鉴”，“千万不可照正面，只照他的背面”是话中有话啊，有“红学家”更是把这句话奉为研究红学的“圣旨”。"
mainflag[123] = 1;
sexflag[123] = 1;

character[124] = "贾赦"
profile[124] = "荣府大老爷，“姬妾丫鬟最多”，大色鬼也，好像也没有别的好说了，细看一下好像也还有得说（我发现我是越来越贫了）在25回凤姐疯了，宝玉不中用了，贾政都已心灰意冷了，而贾赦“还各处去寻僧觅道”，“百般忙乱”，按说贾赦对凤姐只怕和邢夫人对凤姐的心思差不多，和宝玉更是伯父和侄儿的关系，亲老子不急，倒是这伯父急得不行，不知曹公这么写的目的是想表现贾赦的什么性格。除此，找不到他的好来，想霸占鸳鸯，不成买了一小妾，还要置鸳鸯于死地，石呆子的事多少也与他有些关系，最让人痛恨的就是“卖女儿”了，想想就来气，可怜了迎春了，sigh~~"
mainflag[124] = 1;
sexflag[124] = 1;

character[125] = "贾四姐"
profile[125] = "“贾琼之母也带了女儿四姐儿”，一句话就把她交代清楚了，“生得好，说话行事与众不同”，颇得贾母的喜欢，因此留着多住了两日。"

character[126] = "贾喜鸾"
profile[126] = "“贾(王扁)之母也带了女儿喜鸾”，其余同上，与四姐不同的是她还在书中说了一句话，就被众人羞得低下了头。"

character[127] = "贾荇"
profile[127] = "第二批群众演员，在53回祭祖的时候“内仪门挨次列站”，完毕。"
sexflag[127] = 1;

character[128] = "贾芷"
profile[128] = "第二批群众演员，在53回祭祖的时候“内仪门挨次列站”，完毕。"
sexflag[128] = 1;

character[129] = "贾演"
profile[129] = "第二批群众演员，在53回祭祖的时候“内仪门挨次列站”，完毕。"
sexflag[129] = 1;

character[130] = "贾源"
profile[130] = "“宁国公贾演荣国公贾源”，贾府富贵的最初奠基者，呵呵，连群众演员都不需要的。"
sexflag[130] = 1;

character[131] = "贾雨村"
profile[131] = "平儿说的好“那贾雨村什么风村，半路途中那里来的饿不死的野杂种！”。“姓贾名化，表字时飞，别号雨村”，好事没有一件，坏事倒不少，不说他忘恩负义，胡断拐子案，不说他丧净良心整死石呆子，光是有事没事地让宝玉不舒服就让人受不了。"
sexflag[131] = 1;
mainflag[131] = 1;

character[132] = "贾芸"
profile[132] = "这也是个“二爷”，凤姐麾下干将之一，据说是在后面该出彩的一个人物，用“据说”是因为是后来红学家根据某某批某某评断定的，反正曹公没说。我不大欣赏的是他的认宝玉作父亲，所欣赏的是据说他是有情有意的人，后来还去狱神庙探望凤姐和宝玉。呵呵，“勾搭”小红是一套一套的，很值得我辈学习啊，:PP"
sexflag[132] = 1;
mainflag[132] = 1;

character[133] = "贾珍"
profile[133] = "贾家的长房长孙，所以由他担任族长是很自然的，（长孙就是好，我们家祖传的几十本家谱都传给我大堂兄了，那可是从公元900多年开始我们家族的全部历史啊，我也想要！！555）他这个族长一点也没有族长的样子，带着兄弟们寻欢问柳，他最人感兴趣的是他是否真的与可卿有过暧昧之事，估计除了曹公谁也不敢肯定说有或者没有，虽然我一万个不愿意，可是我不得不承认，从书中的点点滴滴看来，很难说他们翁媳之间是清白的。还有三姐的死和他是有关系的，想起这事就恨的牙根痒痒的！"
sexflag[133] = 1;
mainflag[133] = 1;


character[134] = "贾政"
profile[134] = "贾母次子，“自幼酷喜读书，祖父最疼，原欲以科甲出身的，不料代善临终时遗本一上，皇上因恤先臣，即时令长子袭官外，遂额外赐了这政老爹一个主事之衔，令其入部习学，如今现已升了员外郎了。”有人说他的名字是“假正”，这个我觉得有些不大对，他还真是个古板正经的人，忠、孝都无话可说，他对宝玉也是爱的，不过宝玉经常打击他的望子成龙，在“大观园试才题对额”一回中面对宝玉的出色表现，他的反应也是正常的，一向很严厉的父亲，你能指望着他这个时候摸着宝玉的头夸他吗？（我记忆中，我老爸就从来没有当人面或私下里表扬过我，呵呵）。其实他也不是那种古板得不可救药的人，在“制灯迷贾政悲谶语”一回中也会逗贾母开心。对于这回中贾政的悲谶语，“回至房中只是思索，翻来复去竟难成寐，不由伤悲感慨，”，我一直找不到一种恰当的说法表达自己对这一段的感觉，（分特！如果再长期在计算机前这么坐下去，我怀疑我还能否表达出任何想法来！）算了，说另外一个我有疑问的地方吧，我总觉得贾政的官职是不怎么大的，可是为什么他竟然能荐贾雨村担任应天府知府？"
sexflag[134] = 1;
mainflag[134] = 1;

character[135] = "贾珠"
profile[135] = "贾政的大儿子，“十四岁进学，不到二十岁就娶了妻生了子，一病死了。”，“（王夫人）便叫着贾珠哭道：‘若有你活着，便死一百个我也不管了。’王夫人哭着贾珠的名字，别人还可，惟有宫裁禁不住也放声哭了。贾政听了，那泪珠更似滚瓜一般滚了下来。”我想，也许对于贾政来说，贾珠才是他真正想要的儿子，站在贾府的立场上，贾珠才是真正可以光宗耀祖的人，可惜命苦。"
sexflag[135] = 1;

character[136] = "贾宝玉"
profile[136] = "呵呵，终于逃不过了，以前写的那么多都是配角，或者是配角的配角，或者干脆是群众演员，姓贾的他是最后一个了，不过既然是素描嘛，多了不能写，没那个时间和状态，写少了又觉得对不起宝二爷，而且也无从下笔。有关他的问题太多了，如他的生日是何日？大名是什么？，到底有没有真的悟，什么时候悟的？他对宝钗是否真的有过超乎姐弟的感情？他的女儿三段论以及泥与水的论断，他对于世间万物的博爱，他对女儿的钟爱，他是否有过“龙阳之兴”，他的厌恶科举仕途经济，他的叛逆是否是真的叛逆，还可以谈论谈论他这个人物的象征意义，他作为石头、神瑛侍者和宝玉的三者合一在整个故事中所搬演的角色，以及他和各个主要人物的关系等等等等，对于这些问题，每个看过红楼的多少都会有些自己的想法，写出来，然后再抄些原文估计一篇论文就差不多了，呵呵。得，既然问题太多了，那么最好的办法就是一个都不写了。:PPP"
sexflag[136] = 1;
mainflag[136] = 1;

character[137] = "兼美"
profile[137] = "“再将吾妹一人，乳名兼美字可卿者，许配于汝。”呵呵，此乃仙人也，这个可卿与那个可卿有什么关系，红学家和红迷们各有看法，这里不多说，也许这里也用可卿这个名字更多的是一种象征意义。说到名字，其实红楼人物的名字也可以作一篇大论文的，提个小问题，红楼中的男子，尤其是些不重要的人物，大多都是有大名的，可是这宝玉为什么没有大名，宝玉只是他的小名啊，在我们家乡，小名和乳名是同一个概念。过去“大户人家”的孩子的名字应该有很多的，我的名字就有很多个：名，一个汉字，还是挺偏的的一个字，估计除了我老爸和我还能偶尔想起外，连老妈都不一定能想起我的“名”来；字，两个汉字，是我外公（姥爷）替我取的，也是我和我老爸最喜欢的一个名字，我现在身份证上用的就是这个名字；派名，两个字，其中中间那个字是标志辈份的，我的辈份是个“历”字（我的下一辈是“代”），第二个字的偏旁和我的堂兄堂弟的派名中相应的汉字的偏旁是一样的，三点水，所以白水还真和水有点关系，:)；还有个乳名，呵呵，我的乳名可不是什么小猫小狗蛋蛋之类的名字，不过也比较“俗”而已；到正式上学了，我二伯父还给我取了个学名，不过我老爸觉得没有我的“字”好，就只是记入了家谱；好像还有个什么“号”之类的，反正我小堂弟出生后我记得是有这么个名字的，不过我的“号”估计连我老爸都想不起来了；所有这些名字中的任何一个字是不能和我的所有应该顾忌到的长辈的任何名字有相同的，在我们那，连音都不能同，南方人，l、n不分，前鼻音后鼻音不分，等等，所以这些都得避讳，今年寒假回家我给我那小侄孙取了若干很好的名字，可是因为这个缘故基本上都被否决了，气死我也，呵呵。后来遇到了白水，我又给自己取了黑土作为笔名，现在上网了，我就把“白水黑土”作为我的匿称，而且和“eleshock”这个ID决不分离。不管最多会有多少个名字吧，这“名”和“字”肯定是该有的，而宝玉就一个小名，这贾政能同意吗？只是曹公没说，所以又惹得后世的红学家们费劲了脑汁给宝玉“取名”，呵呵。"
mainflag[137] = 1;

character[138] = "蒋子宁"
profile[138] = "平原侯之孙世袭二等男，送殡时出来的，对了，想到一个问题，好像这世袭爵位是越来越往下降的，不知道这世袭官职是否也降？如“贾珍，因他父亲一心想作神仙，把官倒让他袭了。”他这个官是否就是贾敬的原来官职呢？"
sexflag[138] = 1;

character[139] = "绛珠草"
profile[139] = "这也单独算个人物？得，既然生成了这么个文件，就写点吧，“只因西方灵河岸上三生石畔，有绛珠草一株，时有赤瑕宫神瑛侍者，日以甘露灌溉，这绛珠草始得久延岁月。后来既受天地精华，复得雨露滋养，遂得脱却草胎木质，得换人形，仅修成个女体，终日游于离恨天外，饥则食蜜青果为膳，渴则饮灌愁海水为汤。只因尚未酬报灌溉之德，故其五内便郁结着一段缠绵不尽之意。恰近日这神瑛侍者凡心偶炽，乘此昌明太平朝世，意欲下凡造历幻缘，已在警幻仙子案前挂了号。警幻亦曾问及，灌溉之情未偿，趁此倒可了结的。那绛珠仙子道：‘他是甘露之惠，我并无此水可还。他既下世为人，我也去下世为人，但把我一生所有的眼泪还他，也偿还得过他了。’”所以我觉得曹公的本意不是什么“钗嫁黛死”，而是让黛玉在泪尽的时候就先去世了，然后才有钗嫁。说到三生石，我去杭州看罗大佑演唱会的时候，一网友还特意带我去飞来峰下看了那儿的三生石，那个地方基本上没人知道，是她无意中发现的，石头上刻着“三生石”，还有不知道哪个年代哪个人刻的一段关于三生石的故事（也就是佛教中那个有名的三生石的故事）。关于这个三生石我还有一段故事，显然，我去杭州找的这个网友是我喜欢的一个女孩，是在未名认识的，其中的过程就了，到了杭州后，在杭州的三天里，我们游览了很多了杭州的大小景点，也照了近三个胶卷的照片，她很少照，因为她说每个景点她基本上都有很多照片，每次给她照都是我死皮赖脸照的，只有在三生石旁，她主动要求我给她照了一张照片，然后她也给我照了一张，可是回来洗出来后，却发现独独这两张照片上的人连脸形都严重变形了，其他几十张照片都很正常，我一直迷惑不解，这到底意味着什么，后来我知道了，因她的出国，我们的交往也逐渐少了、淡了，难道在那一刻三生石真的显灵了？sigh~~~（呵呵，我发现自己有点信口开河了，想到什么写什么，与红楼也远了，sigh！）"
mainflag[139] = 1;

character[140] = "娇红"
profile[140] = "“大老爷那院里娇红姑娘”，在70回放风筝那一节名字出来了一次，不知道这娇红是个小妾还只是个丫头。"

character[141] = "锦乡侯"
profile[141] = "不明"
sexflag[141] = 1;

character[142] = "娇杏"
profile[142] = "甄士隐的丫鬟，当年回顾雨村者，呵呵，“偶因一着错，便为人上人。”不知道她算不算薄命司里的人物。和香菱正好换了个地位，一个由丫头变成主子，一个由主子变成丫头，曹公这么写的意思大概是想说明世事的变幻莫测和命运的不可抗拒吧，唉，谁知道呢？"
mainflag[142] = 1;

character[143] = "焦大"
profile[143] = "“只因他从小儿跟著太爷们出过三四回兵，从死人堆里把太爷背了出来，得了命；自己挨著饿，却偷了东西来给主子吃；两日没得水，得了半碗水给主子喝，他自己喝马溺。”真乃忠仆也！宁府这帮兔崽子们一点也不知道报恩，真是叫人不平。不过毕竟胳膊扭不过大腿，你是人家的下人就是下人，有了功劳也得收敛点，现在的老板最不满的也是这个。他的名言是“爬灰的爬灰，养小叔子的养小叔子”，这也是红学家的研究热点，也永远也不会有定论的，呵呵，我就不凑热闹了。"
sexflag[143] = 1;
mainflag[143] = 1;

character[144] = "金彩"
profile[144] = "鸳鸯她爹，“两口子都在南京看房子，从不大上京。”到鸳鸯誓绝鸳鸯偶的时候“得了痰迷心窍，那边连棺材银子都赏了，不知如今是死是活。”"
sexflag[144] = 1;

character[145] = "金钏"
profile[145] = "王夫人的大丫头之一，因和宝玉开了句玩笑，让王夫人赶了出来后投井自杀了，她肯定想不到她自己说的“金簪子掉在井里头”也成畿语了，而且这么快就成为现实了。电视里的金钏投井好像还没有出贾府，而且是口井口很小的井，我反复看了好几次都没有看清楚是怎么跳下去的。sigh，也是个性格刚烈的女孩。"
mainflag[145] = 1;

character[146] = "金哥"
profile[146] = "长安县张大财主的女儿小名金哥，父母爱势贪财，女儿却知义多情，“闻得父母退了前夫，他便将一条麻绳悄悄的自缢了。”sigh，薄命女儿也。这也是凤姐造下的罪孽啊。"
sexflag[146] = 1;

character[147] = "金荣"
profile[147] = "璜大奶奶的侄儿，大闹学堂的始作俑者，最后也弄的灰头灰脸的，呵呵，小孩子打架，不会有谁对谁错一说，虽然有些可恶，但也不失可爱，呵呵，如果搁现在就没准是个街头小地痞。"
sexflag[147] = 1;

character[148] = "金文翔"
profile[148] = "鸳鸯她哥，是个没用的家伙，虽不能说他帮着贾赦来逼迫鸳鸯嫁给他，可是至少他心里是愿意鸳鸯嫁给贾赦的，不过话又说回来，他不愿意又能怎样呢？"
sexflag[148] = 1;

character[149] = "金星"
profile[149] = "“只听金星玻璃从后房门跑进来，口内喊说：”（73回），“故走来悄悄的央求晴雯金星玻璃等人”（74回），所以你说这金星玻璃是一个人呢还是两个人？"

character[150] = "锦乡侯诰命"
profile[150] = "他们是两口子，锦乡侯没有正面出场，一次是他儿子给可卿送殡，一次是他夫人出席贾母的寿宴，做陪客，陪的当然是爵位比他们高的了，南北王妃。"
sexflag[150] = 1;

character[151] = "景田侯"
profile[151] = "不明"
sexflag[151] = 1;

character[152] = "裘良"
profile[152] = "“景田侯之孙五城兵马司裘良”，曾经在14回出现为可卿送葬。"
sexflag[152] = 1;

character[153] = "警幻仙子"
profile[153] = "又叫警幻仙姑，“居离恨天之上，灌愁海之中”，详细地址“乃放春山遣香洞太虚幻境”，职责是：“司人间之风情月债，掌尘世之女怨男痴。”为此，她制作了一个“专治邪思妄动之症，有济世保生之功”的“风月宝鉴”。好象还应该为她在书中的象征意义说点什么，这次只好对不住她了。"
mainflag[153] = 1;

character[154] = "净虚"
profile[154] = "馒头庵的姑子，“这馒头庵就是水月庵”。呵呵，这馒头庵的最初来历恐怕不是那儿的馒头好吃，而是来自于“纵有千年铁门槛，总须一个土馒头”，是啊，这样的诗对积极性有着致命的打击的。这净虚也不干好事，身在佛门，却干些害人的勾当，逼死金哥的元凶之一。"

character[155] = "可人"
profile[155] = "“死了的可人和金钏”，不知是哪个的丫头，也不知为何而死，如果不死也是个有身份的丫头的。"

character[156] = "空空道人"
profile[156] = "石头记的最初发现者，“从此空空道人因空见色，由色生情，传情入色，自色悟空，遂易名为情僧，改《石头记》为《情僧录》。”可见为《红楼梦》痴迷终身的他是第一人。"
sexflag[156] = 1;
mainflag[156] = 1;

character[157] = "孔继宗"
profile[157] = "“贾氏宗祠”四个字，旁书“衍圣公孔继宗书”。也是位公爵级别的人物，是真的字写得好呢还是有点现在的名人题名的感觉？"
sexflag[157] = 1;

character[158] = "葵官"
profile[158] = "“大花面葵官送了湘云”，湘云和大花面有什么关系呢？think，在“蔷薇硝事件”中也是和赵姨娘过过招的，呵呵，后来还让湘云扮了成小子，取了大名“韦大英”，“暗有‘惟大英雄能本色’之语”。湘云的性格也可以从这儿得到一个证据。"

character[159] = "来升"
profile[159] = "“宁国府中都总管”，出场不多，但是可以知道他要管的事绝对少不了。他还是挺识时务的，凤姐要来管理宁国府，他就事先告诫手下“每日大家早来晚散，宁可辛苦这一个月，过後再歇着，不要把老脸丢了。”"
sexflag[159] = 1;

character[160] = "来升媳妇"
profile[160] = "妇以婿贵，所以来升媳妇肯定也是个有身份的奴才，只有在14回和凤姐说过几句话，没别的了。"

character[161] = "来旺儿"
profile[161] = "凤姐手下的得力奴才之一，事情估计是干了不少，不过书中说的都不是什么好事，他刚出场不久就是替凤姐去长安县给净虚办事，然后就是无意地泄露了二姐的事，接着就是按凤姐意思逼着张华打官司告贾琏，最后还想依仗凤姐之力给自己那“酗酒赌博，容颜丑陋，一技不知”的儿子强娶彩霞。大概是爹没干好事，所以上天也只给他这么一个不成器的儿子。"
mainflag[161] = 1;
sexflag[161] = 1;

character[162] = "来旺媳妇"
profile[162] = "凤姐手下的五大“家的”之一，她的主要出场都是在凤姐协理宁国府的时候协助了一下凤姐，什么拿点东西了，伺候凤姐喝茶漱口了等等，后面就没有写她什么事了。"

character[163] = "来喜"
profile[163] = "不明"
sexflag[163] = 1;

character[164] = "来喜家的"
profile[164] = "夫妇俩是陪房，至于是谁的陪房，书中没说，虽然学过排除法，可是还是不敢乱猜。大抵陪房都是有些身份的，不过书中没有写过他们夫妇俩的任何活动。"

character[165] = "来兴"
profile[165] = "好像姓“来”的都是有些身份的奴才，这来兴大概也是这样的，他名字唯一的露脸就是第33回（宝玉挨打的那回）里贾环告诉贾政有人跳井了，贾政一着急，“喝令快叫贾琏、赖大、来兴。”呵呵，看来猜的没错，他和赖大并列就知道身份不低了。"
sexflag[165]=1;

character[166] = "赖大"
profile[166] = "大概是荣府地位最高的奴才，身份是大管家，理由有很多，比如奴才们请贾母吃年酒，排第一个的就是赖大，还有管家们名字出现时他也是第一个（有点象报纸上政治局领导人的排名一样，呵呵）。既然是大管家，关于他的事情应该不会少，不过印象最深的还是晴雯系赖大家用银子买的，后来赖大见贾母喜欢就送给了贾母。"
sexflag[166] = 1;

character[167] = "赖大家的"
profile[167] = "大管家的夫人，想来地位也不低，和她丈夫一样，应该是管的事不少，不过没什么好说的，养了个出息的儿子，仅此而已。"

character[168] = "赖二"
profile[168] = "宁府“大总管”，派焦大“黑更半夜送人”，让焦大一顿臭骂，“说他不公道，欺软怕硬”，呵呵。不知道这赖二和赖大是不是两兄弟，如果是的话，那么兄弟俩分别在荣宁二府当大总管，也是很难得的了。"
sexflag[168] = 1;

character[169] = "赖嬷嬷"
profile[169] = "赖大的老妈，是不是赖二的妈还有待考证（不过凭书中记载也考不出什么东西来），在荣宁二府都是很有面子的，儿子能干，孙子也有出息，享老来福的人，sigh，不过也是熬出来的啊，正如她教训孙子的“也不知道你爷爷和你老子受的那苦恼，熬了两三辈子，好容易挣出你这么个东西来。”是谓“吃的苦中苦，方为人上人”啊。"

character[170] = "赖尚荣"
profile[170] = "赖大之子，应该就是那个当了“州县官”的，虽然是个奴才的儿子，可是由于“上托着主子的洪福，下托着你老子娘，也是公子哥儿似的读书认字，也是丫头、老婆、奶子捧凤凰似的”，所以他这奴才算是熬出来了。还和柳湘莲交好。估计贾家失势以后，他这“州县官”只怕也当不成了。"
sexflag[170] = 1;

character[171] = "赖升"
profile[171] = "我怀疑这赖升就是前面说过的赖二，理由嘛，赖升是宁府的管家，赖二是宁府大总管（第7回），而54回里贾母吃年酒的顺序是“十八日便是赖大家，十九日便是宁府赖升家，二十日便是林之孝家......”。所以他是比林之孝还有地位的一个奴才，除了大总管恐怕没别人了。"
sexflag[171] = 1;

character[172] = "老苍头"
profile[172] = "“薛蟠之乳父”，48回里薛大爷要去创就自己的“事业”，薛姨妈派他跟着去了。"
sexflag[172] = 1;

character[173] = "老三"
profile[173] = "“戴权道：‘事倒凑巧，正有个美缺。如今三百员龙禁尉短了两员，昨日襄阳侯的兄弟老三来求我，......’。”原来是这么一个老三！大学时，按年龄我在我们宿舍排第三，因此同宿舍的或者和我们宿舍来往密切的同学都叫我老三，一直到现在。"
sexflag[173] = 1;

character[174] = "老僧"
profile[174] = "这个老僧指的是贾雨村在智通寺见着的那个，当时在那儿煮粥，“既聋且昏，齿落舌钝，所答非所问。”"
sexflag[174] = 1;

character[175] = "老田妈"
profile[175] = "“这一个老田妈本是种庄稼的，稻香村一带凡有菜蔬稻稗之类，虽是顽意儿，不必认真大治大耕，也须得他去。”既然是田妈，当然得管庄稼了。"

character[176] = "老叶妈"
profile[176] = "“怡红院有个老叶妈，他就是茗烟的娘。那是个诚实老人家，他又和我们莺儿的娘极好，不如把这事交与叶妈。”，什么事呢？呵呵，就是管理院子里的花花草草。"

character[177] = "老祝妈"
profile[177] = "“这一个老祝妈是个妥当的，况他老头子和他儿子代代都是管打扫竹子，如今竟把这所有的竹子交与他。”不过不知道她这管竹子的后来为什么去葡萄架下去赶马蜂，是后来又承包了果园还是曹公写着写着就忘了她的职责了。上面这三个“老*妈”都是探春实行承包责任制以后的第一批承包者，呵呵，发现什么规律了吗？水木红楼版聚的时候有人考我问老祝妈管的是什么，如果当时我的人物素描写到这儿来了，就太简单了，不知道有没有姓“竹”的，如果有那么曹公就不会叫她老祝妈而是“老竹妈”了，呵呵。"

character[178] = "老赵"
profile[178] = "“户部堂官”，不知“堂官”是什么职务？好像不是“干事”一种的，因为戴权还要说是“拜上他”。出现在贾珍找戴权为贾蓉捐官的一节。"
sexflag[178] = 1;

character[179] = "乐善郡王"
profile[179] = "贾府的世交，71回中贾母生日，他来过，不过只在宁府。"
sexflag[179] = 1;

character[180] = "冷子兴"
profile[180] = "周瑞家的女婿，贾雨村的好友，“都中在古董行中贸易的”。红楼四个线索人物“真假难留”之“难”，“演说”过荣国府，借他的口，荣宁二府的主要人物都一一亮相。"
sexflag[180] = 1;
mainflag[180] = 1;

character[181] = "李贵"
profile[181] = "“宝玉的奶母之子”，大概是在宝玉外出的时候跟着什么的，他的名言是“呦呦鹿鸣，荷叶浮萍”，我怀疑他是从是“呦呦鹿鸣，食野之苹”转化过来的，其实“荷叶浮萍”挺有“意境”的，只可惜贾政欣赏不了，呵呵。李贵还是很有大哥风范的，看他处理“大闹学堂”一节就知道了，有理有利有节。"
sexflag[180] = 1;

character[182] = "李嬷嬷"
profile[182] = "“宝玉的奶母”，也是李贵的老妈，这乳母陪侍“乳子”一般要陪侍到什么时候呢？有考证爱好者不妨考证一下，很可能就能推算出黛玉进贾府的年龄的千古之谜了。从书中看，李嬷嬷在第三回中肯定是陪侍的，“宝玉之乳母李嬷嬷，并大丫鬟名唤袭人者，陪侍在外面大床上。”第八回不确定，到第十九回多半是不陪侍了。这李嬷嬷越老越糊涂，没事就排揎宝玉的人，这叫自己不尊重自己，何苦来着？"

character[183] = "李绮"
profile[183] = "李纨的小堂妹，我不大明白曹公安排他们出场的目的究竟是什么？难道仅仅表现一下老天有多少“精华灵秀”（呵呵，电视剧中宝玉说的不是这四个字，去年温习电视剧的时候，看到这儿时，感觉好像咯噔了一下，一查书果然剧中宝玉说的和书中宝玉说的不是同一个词语。看电视剧时，如果剧中人物的活动和对白完全按照书上的原文，那感觉就象随着哗哗溪水流过，一旦碰到某个改动了的地方，就好像溪水碰到一块石头，改动地越大，石头也越大，如果瞎改一气，看的时候，心里就堵的慌。）她在书中的活动大概就是参加了一次诗社和荣府的元宵夜宴，最后还不知所终。"
mainflag[183] = 1;

character[184] = "李纹"
profile[184] = "她在书中的活动和她妹妹李绮差不多，唯一不同的是多写了一首诗，《咏红梅花》“梅”字韵。"
mainflag[184] = 1;

character[185] = "李衙内"
profile[185] = "大家看过的古典文学中，衙内是不是专指有点家庭背景而又好色的那种公子哥啊？高衙内如此，李衙内也不例外，本是“长安府府太爷的小舅子”，看上了人家的未婚妻，因此就想强娶，不惜把人家害的家破人亡，怎么所有的衙内都这一德性？"
sexflag[185] = 1;

character[186] = "李员外"
profile[186] = "77回，“有人请老爷寻秋赏桂花”，贾政带着宝玉贾环贾兰去了，同赏桂花的有个叫李员外，他送了宝玉一份礼物，仅仅如此。他倒好，就因为送了宝玉一份礼物，害的我将77回、78回来回扫了无数眼，想找到更多的他的信息，无奈就这么多。"
sexflag[186] = 1;

character[187] = "莲花儿"
profile[187] = "“迎春房里的小丫头”，大闹厨房的主角和始作俑者。电视中的描写是莲花儿在厨房砸东西的时候在柜子里发现玫瑰露后晚上带着林之孝家的来捉脏，而书上的情节是林之孝家的晚上在路上碰到五儿，见她“辞钝色虚”，“心下便起了疑”，正巧莲花儿等几个经过，就浇了点油，于是引出茯苓霜和玫瑰露事件。呵呵，我觉得电视剧的编剧们有点冤枉莲花儿了。"

character[188] = "良儿"
profile[188] = "坠儿偷镯子被发现后，平儿来找麝月说这事时，提到“那一年有一个良儿偷玉，刚冷了一二年间，还有人提起来趁愿，这会子又跑出一个偷金子的来了。”至于这个良儿是谁的丫头当然也就没法考证了。"

character[189] = "林如海"
profile[189] = "“姓林名海，表字如海，乃是前科的探花，今已升至兰台寺大夫，本贯姑苏人氏，今钦点出为巡盐御史”，“钟鼎之家，书香之族”这是他的档案，其实最重要的是他是黛玉的父亲。他这一辈子也是不幸得很，儿子夭折，夫人病逝，自己也早逝，也许曹公这么写得目的是为了成全黛玉和宝玉的朝夕相处，不过还是太过不幸，让人心存不忍也。我最不忍看到的就是一个大家族（或其他团体）的土崩瓦解，《红楼梦》如此，《百年孤独》也如此。"
mainflag[189] = 1;
sexflag[189] = 1;

character[190] = "林之孝"
profile[190] = "荣府的二管家，两口子“一个天聋，一个地哑。”打点着荣府大大小小的事务。有一点不是很明白的，一般说来，老子是有点地位的奴才的，子女虽然是奴才，但是也是有一定地位，或者还可以象赖尚荣一样当个小官，怎么小红一开始就只能是末等丫头呢？唯一的解释就是这两口子都是不存私心，呵呵。"
mainflag[190] = 1;
sexflag[190] = 1;

character[191] = "林之孝家的"
profile[191] = "五大家的之一，写点什么呢？（我竟然整整20天没有写素描了，也不知道忙些什么，有网友来信催了，呵呵。）就写写她在书中干了些什么吧，负责叫人下帖请妙玉；凤姐生日，凑份子，她负责从下人们那儿收钱；鲍二媳妇吊死了，贾琏委托她善理后事；宝玉为黛玉要回家病了，她来瞧，因老公姓林，被贾母禁止入园；玫瑰露事件，误抓五儿及柳嫂；平时接待接待来宾，没事时传传话，查查夜，教导教导大小丫头们；就这些了，事儿挺多的。"
mainflag[191] = 1;

character[192] = "临安伯"
profile[192] = "不明"
sexflag[192] = 1;

character[193] = "临安伯老太太"
profile[193] = "临安伯老太太过生日，凤姐来请示王夫人派谁去，王夫人说“你瞧瞧谁闲著，就叫他们去四个女人就是了，又来当什么正经事问我。”可见这临安伯对于贾府来说没什么份量。"

character[194] = "临昌伯诰命"
profile[194] = "贾母生日，她来拜寿，“上面两席是南、北王妃，下面依叙，便是众公侯诰命。左边下手一席，陪客是锦乡侯诰命与临昌伯诰命，右边下手一席，方是贾母主位”，这坐席可是很有讲究的，今年寒假在家看红楼，看到这一段的时候，还特意请教过我爸，（我回家的前几天我们家（是大家不是小家）正好为我大堂兄得长孙而大摆筵席，据说规模在当地是空前的，呵呵，没办法，我家亲戚朋友多，唉，再次体现了长子长孙的好处来了。）我大概记得如下一些我们那儿的规矩，不知在别的地方是否相同，一般最贵的贵宾是要单间的，在主厅里，背对大门（面对祖宗牌位）右手边最里的一席是整个大厅里最重要的人物坐的，其次是左手边那一桌，依次往外，重要性也降低。每席中，最重要的客人坐在方桌的右上角，每一席主人都得安排一个级别和主客相当的陪客，陪客坐在主客的对面。呵呵，大概如此吧，记得不是很清楚了。贾母坐在右边下手一席，这右手边指的是面对着嘉荫堂大门的右手吧，否则就有些和我老爸说的不一样了。"
sexflag[194] = 1;

character[195] = "龄官"
profile[195] = "小旦，“最是唱的好”，不光元妃有赏，后来宝玉想听《牡丹曲》，也特意去找她，只是她一心在贾蔷身上，懒得理宝玉，呵呵，大抵有点才气的人都是有点傲气的，就连龄官也一样。痴心，龄官画蔷已成红楼经典画面之一，也让宝玉“自此深悟人生情缘，各有分定”；体贴，生病了，贾蔷要去请大夫，她说“这会子大毒日头地下，你赌气子去请了来我也不瞧。”还有她对于雀儿的那段话也显出她与别的女孩不一样来，（想不出用哪个词语来表达，呵呵，我发现每当我写这些素描的时候就象一白痴，脑袋里都是空白的，经常是看着屏幕，文字越来越模糊，而画面越来越清晰，就是想不出怎么表达好）。"
mainflag[195] = 1;

character[196] = "刘姥姥"
profile[196] = "红楼四大线索人物之一，见证了贾府从鼎盛到衰败的全过程，网友千杯不醉说她是“聪明的村妪”，我想光用聪明二字还无法全部概括刘姥姥，她对人情世故的通晓，对所受恩惠的回报，所谓“世事洞明皆学问，人情练达即文章”，千杯不醉说“人啊，谁也别瞧不起谁。”确实我们可以从姥姥身上学的东西还不少。"
mainflag[196] = 1;

character[197] = "刘氏"
profile[197] = "刘姥姥的女儿，狗儿嫡妻，青板姊妹的母亲，到底是年轻媳妇，面子薄，家里揭不开锅了，也不肯上贾府来，只好撺掇自己的老母亲“去打嘴现世”。"

character[198] = "柳彪"
profile[198] = "不明"
sexflag[198] = 1;

character[199] = "柳芳"
profile[199] = "理国公柳彪之孙现袭一等子柳芳在为可卿送殡时出来过。别无他话。"
sexflag[199] = 1;

character[200] = "柳二媳妇"
profile[200] = "有人向凤姐举报：“柳二媳妇和他妹子通同开局，凡妹子所为，都是他作主”。幸亏凤姐此时想“作个好好先生，得乐且乐，得笑且笑，”否则这两姐妹可就得吃不了兜着走了。"
