
character[201] = "柳家的"
profile[201] = "五儿她妈，“梨香院的差役”，“他最小意殷勤，伏侍得芳官一干人比别的干娘还好。”呵呵，和何婆子正好是两个典型。估计戏团解散后她就分配到厨房去了。玫瑰露事件的被冤枉者，我想大多数人的同情心是放在他们母女身上的，可是这柳嫂子是不是也有什么地方做得不对的呢？她为了女儿的前途，对晴雯和司棋截然相反的态度以至于得罪司棋和莲花儿，是这次事件的导火索。呵呵，还有啊，61回开头她对一小厮说的那段话，每次看都会把我逗坏了，对她有一种似曾相识的感觉，我可见识过不少这样的大妈大婶的，呵呵。"
mainflag[201] = 1;

character[202] = "隆儿"
profile[202] = "贾琏的心腹小童隆儿，就在65、66两回出来过，都是去二姐那儿贾琏带他去的，可见确实是个心腹。"
sexflag[202] = 1;

character[203] = "娄氏"
profile[203] = "贾菌之母也，只在荣府元宵开夜宴的时候带着贾菌出来过一次。"

character[204] = "缕儿"
profile[204] = "看情形好像是湘云在史府的贴身丫鬟，名字仅出来一次，没法多说。"

character[205] = "马道婆"
profile[205] = "这个人物是个讨人嫌的，本来是“宝玉寄名的干娘”，却心术不正，见钱眼开，撺掇赵姨娘两人暗中作法陷害凤姐和宝玉。“寄名的干娘”好像在我们那叫做寄娘，小时候我因为多灾多病的，所以也认了个寄娘。"
mainflag[205] = 1;

character[206] = "马魁"
profile[206] = "不明"
sexflag[206] =1;

character[207] = "马尚"
profile[207] = "治国公马魁之孙世袭三品威远将军马尚在为可卿送殡时出来过。别无他话。"
sexflag[207] = 1;

character[208] = "茫茫大士"
profile[208] = "将宝玉携入红尘，历尽离合悲欢炎凉世态的两位神仙之一。"
sexflag[208] =1;
mainflag[208] = 1;

character[209] = "梅翰林"
profile[209] = "不明"
sexflag[209] =1;

character[210] = "梅翰林之子"
profile[210] = "薛家将宝琴许配都中梅翰林之子为婚，有人从书中宝琴的一句诗“不在梅边在柳边”从而得出结论宝琴后来嫁的不是梅翰林之子而是柳湘莲，我对这种说法是不大赞同的。在后面的78回有梅翰林送给宝玉一件礼物，这两处的梅翰林应该就是同一个人吧。"
sexflag[210] =1;

character[211] = "媚人"
profile[211] = "这个也是宝玉的丫鬟，可是既没有来龙也没有去脉，书中只在第五回出来过一次，那是宝玉在可卿床上睡觉，她和袭人等被留下来照看。"

character[212] = "门子"
profile[212] = "“本是葫芦庙内一个小沙弥”，“被火之后，”“蓄了发，充了门子”，经他口，引出了护官符，因为他才知道香菱的身世，可是也是他给贾雨村出主意置恩人于不顾，草菅人命。到底是恶有恶报，让贾雨村那更阴险的家伙“寻了个不是，远远的充发了他才罢”。电视剧中最后，贾雨村犯案，竟然是这个门子押解的，虽然很有戏剧效果，但是未免让人百思不得其解啊。"
mainflag[212] = 1;
sexflag[212]=1;

character[213] = "渺渺真人"
profile[213] = "将宝玉携入红尘，历尽离合悲欢炎凉世态的两位神仙中另外一位。"
sexflag[213]=1;
mainflag[213] = 1;

character[214] = "茗烟"
profile[214] = "呵呵，又叫焙茗，宝玉第一个得用的小厮，也应该算是宝玉的心腹小厮，“且又年轻不暗世事，”一出场就大闹学堂；偷偷地带着宝玉去袭人家；得知宝玉不开心，就“便走去到书坊内，把那古今小说并那飞燕、合德、武则天、杨贵妃的外传与那传奇角本买了许多来，引宝玉看。”看来宝玉的“堕落”和茗烟也是脱不了干系的；替宝玉去找刘姥姥胡诌的破庙；宝玉带着去祭奠金钏，他说的那段话很经典的，限于篇幅，就不引述了，呵呵，说起来他也是宝玉的知己；代宝玉去给秦钟上坟，跟着宝玉去王一贴那求“疗妒汤”，呵呵；平时还跟着宝玉出门，偷偷地给宝玉请个什么人，往外传个什么话的，真是羡慕宝玉有这么一个好书童啊，:)。遗憾的是宝玉挨打时他不知跑哪儿去了，真真该打。还有一个问题，秦钟和智能儿，茗烟和卐儿（万儿）干那警幻所训之事，都让宝玉撞见了，而且都是在宝玉和袭人有云雨之事以后，曹公这么写恐怕是有些用意的，有兴趣者不妨研究研究。"
mainflag[214] = 1;
sexflag[214] = 1;

character[215] = "墨雨"
profile[215] = "也是宝玉的小厮之一，他的戏就少多了，只在大闹学堂一节出来过，也是个淘气的主。"
sexflag[215] = 1;

character[216] = "木居士"
profile[216] = "乃一船工也，呵呵，不过这个船可不是普通的船，乃太虚幻境中“深有万丈，遥亘千里，”的迷津中的一小木筏，木居士专司掌舵。"
sexflag[216] = 1;

character[217] = "穆莳"
profile[217] = "“同乡世教弟勋袭东安郡王穆莳拜手书”。有东平、南安郡王，不知和这个东安郡王有什么关系。"
sexflag[217] = 1;

character[218] = "南安郡王"
profile[218] = "东南西北四大郡王之一，11回贾敬生日时差人来送过礼物，可卿出殡时搭过祭棚，书中这四个郡王除了北静王爷基本上是保持一致行动的。"
sexflag[218] = 1;

character[219] = "南安太妃"
profile[219] = "贾母生日，她亲来祝寿，还赠“宝钗姊妹与黛玉探春湘云”五人礼物，贾母为什么不让迎春和惜春出来呢？以至于后来邢夫人还耿耿于怀。电视剧中把她安排为逼探春出嫁和番，不知有什么根据没有？"

character[220] = "倪二"
profile[220] = "贾芸的邻居，“是个泼皮，专放重利债，在赌博场吃闲钱，专管打降吃酒。”“虽然是泼皮无赖，却因人而使，颇颇的有义侠之名。”本来书中只有他借钱给贾芸一事，电视剧中他后来还参与过救小红等事，大概也是因为他颇有义侠之名。"
sexflag[220] = 1;
mainflag[220] = 1;

character[221] = "宁国公"
profile[221] = "“宁公居长，生了四个儿子。宁公死后，贾代化袭了官”。书中29回有一段“（张道士）又叹道：“我看见哥儿的这个形容身段，言谈举动，怎么就同当日国公爷一个稿子！”说着两眼流下泪来。贾母听说，也由不得满脸泪痕，说道：“正是呢，我养这些儿子孙子，也没一个像他爷爷的，就只这玉儿像他爷爷。””这里的国公爷当然是荣国公了，不过这里就有文章可做了，张道士说的国公爷，从贾母的言语和“流泪”来看，多半指的是贾代善，那么是否贾家第二代袭官，袭的是原职位吗？对于袭官这个问题，在前面已提到过，悼红轩的红米兄给我解答过，不过还是不大明白，一般来说官是越袭越小，可是好像也有世世代代袭原职的，或者袭几代的。"
sexflag[221] = 1;

character[222] = "牛继宗"
profile[222] = "不明"
sexflag[222] =1;

character[223] = "牛清"
profile[223] = "14回中“那时官客送殡的，有镇国公牛清之孙现袭一等伯牛继宗”。"
sexflag[223] =1;

character[224]= "女先儿"
profile[224] = "肯定是民间艺人，至于用现在的名词术语来说的话，我觉得应该是说书人或者是唱京韵大鼓的。分别在书中的54回庆元宵和62、63的宝玉生日时出场过。贾母借着女先儿介绍《凤求鸾》而发表了一番意见，很多人认为这是贾母对宝黛的旁敲侧击，也有很多人因此而认为贾母是反对宝黛婚姻的，但是我更觉得这只是贾母就事论事，对这类书的看法。"

character[225] = "藕官"
profile[225] = "“将小生藕官指与了黛玉”，正旦给宝玉，小生给黛玉，难道目的是让这小两口服侍那小两口，呵呵，看来不是，因为常与小生做夫妻的是小旦。藕官一出场就是烧纸祭奠她死去的“老婆”，可见也是个痴人。何婆子打骂春燕，蔷薇硝事件中和赵姨娘打架，她都是参与者，也是个淘气的主，紫鹃也说“他这里淘气的也可厌。”。最后还是和蕊官跟了地藏庵的圆心出家了，宝黛钗的三位“官”最后的结局都是出家，难道这里也有什么暗示不成？"
mainflag[225] = 1;

character[226] = "潘又安"
profile[226] = "司棋的表弟，也是她的情郎，和司棋在园中幽会，让鸳鸯撞见了，最后在司棋撞墙之后，买好棺材而自杀，颇有点悲壮的味道，sigh！"
sexflag[226] = 1;
mainflag[226] = 1;

character[227] = "佩凤"
profile[227] = "“尤氏的侍妾”，在两府中走动走动，平时玩乐一会，替贾珍传传话，倒也没有什么特别之处，值得一提的是75回中秋“贾珍有了几分酒，益发高兴，便命取了一竿紫竹箫，命佩凤吹箫，文花唱曲，喉清嗓嫩，真令人魄醉魂飞。”，原来佩凤还有这等技艺！"

character[228] = "平安节度"
profile[228] = "68回“话说贾琏起身去后，偏值平安节度巡边在外，约一个月方回。贾琏未得确信，只得住在下处等候。及至回来相见，将事办妥，回程已是将两个月的限了。”他的“巡边在外”，耽误贾琏的时间方便了凤姐有充足的时间来对付尤二姐的。不也正是无巧不成书吗？"
sexflag[228] =1 ;

character[229] = "平儿"
profile[229] = "贾琏的妾，凤姐的总管，也是凤姐的左膀右臂，她的好处不用我多说大家也知道，她的气质，她的善良，她的识大体，她对凤姐的忠，她在贾琏面前的俏，她对下人的维护，等等等等都不是三两句话说得完的。总之，她基本上是一个没有争议的受大家欢迎的人，在书中如此，对读者也是如此。"
mainflag[229] = 1;

character[230] = "戚建辉"
profile[230] = "“襄阳侯之孙世袭二等男戚建辉”，14回中送殡的一员。"
sexflag[230] = 1;

character[231] = "琪官"
profile[231] = "就是蒋玉菡，忠顺亲王府的戏班中唱小旦的，“妩媚温柔”，令宝玉心中十分留念，呵，也是不算臭男人的一个，算一算，宝玉心中不算臭男人的还是有不少，不过大多是带着女性特点，如蒋玉菡、柳湘琏等戏子，秦钟、水溶等“有女儿之态”之男子。因一句“花气袭人知昼暖。”而和宝玉的“宝贝”袭人结下情缘，按照曹公的原意，在后来宝玉落魄后，琪官和袭人还应该照顾过宝玉的。可见当年宝玉为他而挨打还是值得的，呵呵，玩笑，这么想宝玉未免太功利了。"
mainflag[231] = 1;
sexflag[231] =1;

character[232] = "钱华"
profile[232] = "“独有一个买办，名唤钱华，他因多日未见宝玉，忙上来打千儿请安，宝玉忙含笑携他起来。”就像仓上的头目叫戴良（粮）一样，买办叫钱华（花钱）。"
sexflag[232] = 1;

character[233] = "钱槐"
profile[233] = "“内中有一小伙名唤钱槐者，乃系赵姨娘之内侄。他父母现在库上管帐，他本身又派跟贾环上学。”这个钱槐是否就是钱华的儿子还不确定，因为按照曹雪芹取名字的规律，没准管帐的都是姓钱的。“有些钱势，尚未娶亲，素日看上了柳家的五儿标致，欲娶他为妻。”，无奈五儿一心想进怡红院，“执意不从”。五儿到底也没有能进得了怡红院来，这钱槐后来有没有“如愿以偿”就不得而知了。"
sexflag[233] = 1;

character[234] = "茜雪"
profile[234] = "宝玉的丫头，笔墨不多，却是不会让人忘记的一个，因为她大概是宝玉撵走的唯一的一个丫鬟，而且被撵的原因也也很莫名其妙，竟然只是因为宝玉奶妈执意要喝宝玉的茶，而茜雪就让她喝了，为了这么一件小事宝玉就把她给撵走了，有点让人想不明白，好象当时宝玉回贾母要撵的是他乳母而没有提到茜雪啊，怎么茜雪就莫名其妙的被撵走了呢？而且从鸳鸯的话语中可以看得出，茜雪还是和她们一样老资格，有些地位的丫头啊。"
mainflag[234] = 1;

character[235] = "巧姐"
profile[235] = "有关大姐和巧姐的问题，在前面写大姐时提到过，而且贴出来以后至少悼红轩是有过一些讨论的，这里就不重复这个问题了。记得有人抗议过我的签名档，说是里面提到了12钗中的11个，独独少了巧姐，后来我就考虑加进去，有人建议的两句是“象巧姐一样天真无邪，还要象巧姐一样多灾多病”，呵呵，年龄最小的一位金钗嘛，说她天真也可以接受，不过就是书中没有描写而已，多灾多病好像是大姐的事，暂且将她们当作同一个人吧，不过说到多灾多病还不如黛玉呐，所以想了想还是没有改，因为估计即使改完了，也还是有人抗议的，呵呵。"
mainflag[235] = 1;
goldflag[235] = 1;

character[236] = "茄官"
profile[236] = "老旦茄官，剧团解散时让尤氏讨了去。没有别的事了。"

character[237] = "秦氏"
profile[237] = "这个秦氏就是秦可卿了，也就是蓉哥媳妇，关于她，可写的也很多，尤其是她的出身，她与贾珍的关系，她的死因都是可以长篇累牍的考证来考证去的，这里只提一个由她突然想到的问题。荣宁两府的四代人分别的称呼（以女性为例）是：老太太、太太、奶奶（姑娘）、姐儿（？）。这老太太肯定也是从奶奶熬上去的，只是不知该在什么时候改称呼，而且东西两府人丁发展（用词不当，呵呵）速度不一样，还统一来叫就会出现婆媳两人都被叫作奶奶的情况，象可卿和尤氏，一个叫蓉大奶奶，一个叫珍大奶奶，如果下人同时给两人请安，该怎么称呼？呵呵。"
mainflag[237] = 1;

character[238] = "秦显"
profile[238] = "不明"
sexflag[238] =1;

character[239] = "秦显家的"
profile[239] = "司棋的叔叔和婶娘，玫瑰露事件中，柳家母女被冤枉的时候，林之孝家的派她取代柳嫂子的位置，可惜只管了一顿饭就又让人轰走了，而且“送人之物白丢了许多，自己倒要折变了赔补亏空。”落得个“轰去魂魄，垂头丧气，登时掩旗息鼓，卷包而出。”，呵呵，可见她当时也是走后门才能有取代柳嫂子的机会的。"
mainflag[239] = 1;

character[240] = "秦业"
profile[240] = "可卿的养父，秦钟的生父，任营郎，也是个可怜的人，夫人早亡了，70多了又死了女儿，女儿尸骨未寒，又被自己的儿子“气的老病发作，三五日光景鸣呼死了”，不多久儿子也死了，这一家子都赶一块了，想来本也是个小康之家，眨眼之间就这么彻底没了，sigh。"
sexflag[240] =1;

character[241] = "秦钟"
profile[241] = "当为“情种”，可卿之弟。“较宝玉略瘦些，眉清目秀，粉面朱唇，身材俊俏，举止风流，似在宝玉之上，只是怯怯羞羞，有女儿之态，腼腆含糊”。和宝玉见面后，一个愧荼毒了“富贵”，一个恨“贫窭”限人。他和宝玉是否有龙阳之兴呢，呵呵，不好说，反正很暧昧。唉，也是个薄命人啊，不知道薄命司里有没有男性呢？"
mainflag[241] = 1;
sexflag[241] = 1;

character[242] = "青儿"
profile[242] = "刘姥姥的外孙女，考大家一个问题，青儿是板儿的姐姐还是妹妹？:)"

character[243] = "晴雯"
profile[243] = "见到名字就倒吸一口凉气，不为别的，因为很难素描，晴雯和袭人之争就象钗黛之争一样，见仁见智，很难三言两语说清楚，写多了又不像素描了。对她我说不上喜欢和欣赏，但是也绝对没有反感，有的只是叹息。早就发现这个人物素描写下来，我用的最多的就是“sigh/唉”和“呵呵”。晴雯得到最后的结局虽然有很多外部因素，如王夫人、王善宝家的，也有怀疑袭人的，甚至仅仅是因为长的象黛玉，不过不可否认的是她自己的性格也是有些缺陷的，这也是造成她最后结局的因素之一。"
mainflag[243] = 1;

character[244] = "庆儿"
profile[244] = "这个庆儿应该也是凤姐的心腹小厮，他就在张华告贾府中出场过，帮着凤姐打探些情况，调唆调唆张华，还打点一些关系等等。"
sexflag[244] = 1;

character[245] = "庆国公"
profile[245] = "也是个“国公”，在78回中送给宝玉一个旃檀香小护身佛。"
sexflag[245] = 1;

character[246] = "秋桐"
profile[246] = "记得520红楼知识竞赛时有一道题是“秋桐的属相是什么？”。《红楼梦》中让人真正让我讨厌的年青女孩不多，可是秋桐算得上一个，你可以说是她让凤姐利用了，可是凤姐绝对没有唆使她，最后反而让凤姐算计了，给人感觉是又蠢又恶，真不想用这四个字来形容任何一个女孩子，sigh。该不该给她也来一点同情呢？"
mainflag[246] = 1;

character[247] = "秋纹"
profile[247] = "秋纹和麝月经常是同时出现的，后来袭人走的时候交代宝玉好歹留着麝月，不知道是否也将秋纹留下来了，她出场不少，但是好像没有出什么彩，有点印象的倒是她和碧痕一起数落小红。"
mainflag[247] = 1;

character[248] = "裘良"
profile[248] = "“景田侯之孙五城兵马司裘良”，14回中。"
sexflag[248] =1;

character[249] = "入画"
profile[249] = "曹公取名字时肯定是分层次取的，如“琴棋书画”，但是考虑到书中实际情况，入画肯定比抱琴要小得多，难道贾府给丫头取名字的时候也按主子分层次？难道给元春的丫头取名字时就知道一定会知道家里会有而且只有四个小姐？呵呵，也钻了一下牛角尖。记得在写抱琴的时候说丫头要摊上一个好主子，其实谁又能知道抱琴后来的命运呢？元春死了以后估计也好不到哪儿去，侍书的命运前80回看不出来，不过入画倒是知道，而且她的命运也确实与主子有关，摊上一个无情的主子，所以也好不了，最后不知道是配了个小厮还是出家了或者更惨的是沦落烟花巷了？"
mainflag[249] = 1;

character[250] = "蕊官"
profile[250] = "“小旦蕊官送了宝钗”，一个“送”字表明了宝钗在贾府的身份，这段文字中的动词用得很是有讲究的，庚辰本中“贾母便留下文官自使，将正旦芳官指与宝玉，将小旦蕊官送了宝钗，将小生藕官指与了黛玉，将大花面葵官送了湘云，将小花面豆官送了宝琴，将老外艾官【送】了探春，尤氏便讨了老旦茄官去。”，程乙本中“贾母便留下文官自使，将正旦芳官指与宝玉，将小旦蕊官送了宝钗，将小生藕官指与了黛玉，将大花面葵官送了湘云，将小花面豆官送了宝琴，将老外艾官【指给】了探春，尤氏便讨了老旦茄官去。”（“【】”是笔者所加，这两段都是来自QQ驿站的电子版），对比一下就可以看出只有一个地方不一样，我觉得程乙本的“指给”更合适。因为探春也是贾府的主人嘛，而且正如宝玉说的，黛玉自小在贾府长大，府中上下（此处当指贾母）都是把她作为贾府主人来看待的，而宝钗无论如何都是客人。小生藕官的“元配”菂官死了以后补了蕊官，果然这小两口感情好。俗话说打仗是父子兵，可他们打仗是夫妻一块上，“蕊官藕官两个一边一个，抱住左右手”，呵呵。最后连出家都是在一块，sigh。"
mainflag[250] = 1;

character[251] = "瑞珠"
profile[251] = "“秦氏之丫鬟名唤瑞珠者，见秦氏死了，他也触柱而亡。此事可罕，合族人也都称叹。贾珍遂以孙女之礼殓殡，一并停灵于会芳园中之登仙阁。”她的死引来很多猜测，不过权威的说法还是因为她撞见了可卿和贾珍的密事，怕贾珍算帐只好寻短见了，至少电视剧是这么改编的。"
mainflag[251] = 1;

character[252] = "扫红"
profile[252] = "宝玉的小厮之一，在大闹学堂的时候出来过，后来在52回中又陪着宝玉出过一次门，没有太多的描写，不过可以猜到也是个淘气的主。"
sexflag[252] = 1;

character[253] = "扫花"
profile[253] = "也是宝玉的小厮，宝玉的小厮真是多啊，我数来数去，就是没有数清楚，呵呵。"
sexflag[253] =1;
 
character[254] = "色空"
profile[254] = "铁槛寺住持，可卿停灵铁槛寺的时候，他负责接待工作。"
sexflag[254] = 1;

character[255] = "傻大姐"
profile[255] = "“只因他生得体肥面阔，两只大脚作粗活简捷爽利，且心性愚顽，一无知识，行事出言，常在规矩之外。贾母因喜欢他爽利便捷，又喜他出言可以发笑，便起名为“呆大姐”，常闷来便引他取笑一回，毫无避忌，因此又叫他作“痴丫头”。”傻大姐是出场很晚的一个人物（73回），但是对于推动情节却是很重要的一个人物，曹公通过她让王夫人抄检了一次大观园，高鹗通过她泄露了掉包计，从而送了黛玉的命，sigh。"
mainflag[255] = 1;

character[256] = "傻大姐的娘"
profile[256] = "只出来过一次，可是要说清楚，还得费点口舌，74回中，贾琏夫妇通过鸳鸯从老太太那儿偷了些东西出来典当，没想到很快就走漏了风声，是谁透露出去的呢？据调查，当时外人只有傻大姐的娘来过，呵呵，因此她是第一个嫌疑犯。"

character[257] = "山子野"
profile[257] = "建造大观园的监工，还是设计者？书中原文（庚辰）“全亏一个老明公号山子野者，一一筹画起造。”和“凡堆山凿池，起楼竖阁，种竹裁花，一应点景等事，又有山子野制度。”，大概都可以算得上。记得我在最开始人物考察的时候，悼红轩里的阿眉对他的介绍是“山子野见16回，是园林设计家；姓胡，胡公自然也是他；”，可是我至今还是没有找到他姓胡的证据。"
mainflag[257] = 1;
sexflag[257] = 1;

character[258] = "善姐"
profile[258] = "是尤二姐进了贾府以后，凤姐派去服侍二姐的丫鬟，凤姐的帮凶，是造成二姐自杀的直接迫害者之一。可怜二姐还替她着想，为她遮掩，岂不知上了凤姐的当了。"

character[259] = "缮国公"
profile[259] = "当年的八公之一，在可卿去世的时候，他的诰命也亡故了，所以不曾派人来送殡。"
sexflag[259] = 1;

character[260] = "少妃"
profile[260]= "回中朝中大祭，“东西二院，荣府便赁了东院，北静王府便赁了西院。太妃少妃每日宴息，见贾母等在东院，彼此同出同入，都有照应。外面细事不消细述。”，可见这个少妃是北静王的妃子，其他细事无法细述，呵呵。"

character[261] = "麝月"
profile[261]= "这也是个难写的主，尤其是我现在这种只想赶快完成任务的心态。麝月在宝玉的丫鬟中是排第三的，袭人走的时候求宝玉好歹留着麝月，想来麝月最后是被留下来了的，所以有人就猜测麝月的原型是脂胭斋，当然这只是猜测，谁也无法证明。在书中，麝月的口才是很好的，我记得很早以前我在《演讲与口才》杂志上见过一篇文章是分析麝月口才的，确实，麝月在和人争吵时总是能做到有理有利，经典的就是袭人让她震何婆子的那一段。她可写的地方还有很多，这儿只稍微素描一下得了，呵呵。"
mainflag[261] = 1;

character[262] = "神瑛侍者"
profile[262]= "“赤瑕宫神瑛侍者，日以甘露灌溉”，宝玉的前身。"
mainflag[262] = 1;
sexflag[262] = 1;

character[263] = "沈世兄"
profile[263]= "第26回“宝玉道：‘怪道前儿初三四儿，我在沈世兄家赴席不见你呢。……’”（这里的你指的是冯紫英）。不知道这个沈世兄是何许人也？"
sexflag[263] = 1;

character[264] = "石呆子"
profile[264] = "贾赦要收集折扇，“谁知就有一个不知死的冤家，混号儿世人叫他作石呆子，穷的连饭也没的吃，偏他家就有二十把旧扇子，死也不肯拿出大门来。”“谁知雨村那没天理的听见了，便设了个法子，讹他拖欠了官银，拿他到衙门里去，说所欠官银，变卖家产赔补，把这扇子抄了来，作了官价送了来。”“那石呆子如今不知是死是活。”这石呆子也算是个痴人，为了所爱，不惜生命。可惜、可怜、可叹啊。"
mainflag[264] = 1;
sexflag[264] = 1;

character[265] = "石光珠"
profile[265] = "当年所称“八公”之一的缮国公之孙，在第14回中因为“缮国公诰命亡故，其孙石光珠守孝不曾来得。”是不曾来为可卿送殡。"
sexflag[265] = 1;

character[266] = "时觉"
profile[266] = "这个时觉只在70回出场过一次，贾母不许贾琏将二姐送往家庙中，“贾琏无法，只得又和时觉说了，就在尤三姐之上点了一个穴，破土埋葬。”从名字来看时觉很可能是个和尚。"
sexflag[266] = 1;

character[267] = "史鼎夫人"
profile[267] = "第13回“接着，便又听喝导之声，原来是忠靖侯史鼎的夫人来了。”史鼎，14回出场送殡，不知道这个忠靖侯史鼎和史老太君有什么血缘关系没有，书中没说，那就是没有了。"

character[268] = "史公"
profile[268] = "“阿房宫，三百里，住不下金陵一个史。（保龄侯尚书令史公之后，房分共十八，都中现住者十房，原籍现居八房。）”史老太君的先人。"
sexflag[268] = 1;

character[269]= "史鼐"
profile[269] = "“保龄侯史鼐又迁委了外省大员，不日要带家眷去上任。”这里有一个问题了，前几日看《红楼梦注释》（1975年版）上面说除了亲王、郡王等爵位是可以世袭的外，公候伯子男等爵位都是不能世袭的，保龄侯有一个“尚书令史公”，这里又有一个史鼐，难道是皇上后来又加封的？"
sexflag[269] = 1;

character[270] = "侍书"
profile[270] = "探春的大丫头，“琴棋书画”之三，书中出场挺多，但是并没有什么出彩之处，所以可写的也没有。与她身份特相称的一句是书中37回中“侍书一样预备下四份纸笔……”，呵呵。"
mainflag[270] = 1;

character[271] = "守备之子"
profile[271] = "第16回“那守备之子闻得金哥自缢，他也是个极多情的，遂也投河而死，不负妻义。”是凤姐造孽的人命之一。"
sexflag[271] = 1;

character[272] = "寿儿"
profile[272] = "只在第65回出来过一次，地点是在贾琏为二姐准备的府外住处，但是他是贾珍的小厮，呵呵。"
sexflag[272] = 1;

character[273] = "寿山伯"
profile[273] = "第13回中前来上祭礼。"
sexflag[273] = 1;

character[274] = "双瑞"
profile[274] = "不明"
sexflag[274] = 1;

character[275] = "双寿"
profile[275] = "宝玉的小厮，他们俩都只在28回中由宝玉带着去冯紫英家出来过一次。"
sexflag[275] = 1;

character[276] = "水仙庵姑子和老道"
profile[276] = "宝玉为祭奠金钏，去了“宝玉最厌”的水仙庵，姑子和老道们“事出意外，竟象天上掉下个活龙来的一般”“老道来接马，姑子献了茶”还“连香供纸马都预备了来”。呵呵。"

character[277] = "司棋"
profile[277] = "迎春的大丫头，“琴棋书画”之二，她在书中有浓墨重彩的两段，一是她带领莲花儿大闹厨房，二是她和她表弟的恋情。从大闹厨房那段首先可以看出司棋火爆、直爽的性格，当然，她的方式未必可取，其次也可以看出贾府中大丫头的地位。这些天一直在看北师大中文系在1975年编写的一本《红楼梦注释》，毕竟是受时代的影响，书中处处充满了阶级斗争的论调，于是我就想知道这些老先生们把象司棋、晴雯这样的丫头置于哪个阶级上，不知道他们对这种被压迫阶级压迫同样是被压迫阶级的做法是怎么评价的，呵呵。对于她和她表弟的恋爱无话可说，你说是东方的罗密欧和朱丽叶也可以，反正对于非客观能力原因我无法做到而其他能做到的人我一概都是很景仰的。"
mainflag[277] = 1;

character[278] = "四儿"
profile[278]= "最初名“芸香”，后花大姐姐改了蕙香，最后由宝玉定名为四儿，最多算得上宝玉的二等或者三等丫头，也只是干些杂事，最后她因为和宝玉同一天生日，被王夫人赶了出去，宝玉的这番话“四儿是我误了他，还是那年我和你拌嘴的那日起，叫上来作些细活，未免夺占了地位，故有今日”大概说出了她真正不容于怡红院的原因。最后也不知道哪去了，大概是配了小厮吧。"
mainflag[278] = 1;

character[279] = "四姐"
profile[279]= "第71回中，贾母生日，“贾琼之母也带了女儿四姐儿”来参加贾府家宴，因讨贾母喜欢，被留着在大观园住了几天。"

character[280] = "宋妈"
profile[280] = "一、37回给湘云送果子和糕点；二、52回揭发坠儿偷平儿镯子一事；三、77回为晴雯送衣物。不过书中还出现过“宋嬷嬷”和“老宋妈妈”，不知道是否是一个人，这里暂且当她们是同一个人。"

character[281] = "素云"
profile[281] = "李纨的丫头，也是当年的十大丫头之一，不过因为是跟着李纨，所以也不怎么显眼。"

character[282] = "孙绍祖"
profile[282] = "一句“子系中山狼”就足够表明他是个什么样的人了，他一个人在京也仅仅是“兵部候缺题升”，他怎么就赶如此欺负贾家的二小姐呢？难道真的仅仅是因为贾赦欠了他五千两银子？我更觉得也许他仗着在那个时代的“出嫁从夫”，或者是“清官难断家务事”，再加上贾赦欠他钱，所以敢这么有恃无恐。只是迎春可怜了，sigh！"
mainflag[282] = 1;
sexflag[282] = 1;

character[283] = "太妃"
profile[283] = "书中“太妃”二字出现还不少，这里姑且当作是“谁知上回所表的那位老太妃已薨”的太妃。"

character[284] = "太上皇"
profile[284] = "“当今自为日夜侍奉太上皇、皇太后，尚不能略尽孝意，因见宫里嫔妃才人等皆是入宫多年，抛离父母音容，岂有不思想之理？”"

character[285] = "太祖皇帝"
profile[285] = "“说起当年太祖皇帝仿舜巡的故事，比一部书还热闹，我偏没造化赶上。”"
sexflag[285] = 1;

character[286] = "檀云"
profile[286]= "v怡红院的丫头，袭人晴雯之下的二等丫头，宝玉的《夏夜即事》中有“窗明麝月开宫镜，室霭檀云品御香”，《芙蓉女儿诔》中有“镜分鸾别，愁开麝月之奁；梳化龙飞，哀折檀云之齿。”大家说说这两处的麝月和檀云指的是人还是物？"

character[287]= "通事官"
profile[287]= "52回宝琴提到真真国的女孩时说“……因此我父亲央烦了一位通事官，烦他写了一张字，就写的是他作的诗。”估计这个通事官也就是翻译。，就写的是他作的诗。”估计这个通事官也就是翻译。"
sexflag[287] = 1;

character[288]= "同贵"
profile[288] = "薛姨妈的丫头，29回中陪着薛姨妈去清虚观。"

character[289] = "同喜"
profile[289] = "薛姨妈的丫头，29回中陪着薛姨妈去清虚观。她的第二次出场是薛大爷带了些土特产回来后薛姨妈打发她给贾母送些去。娲皇氏也就是女娲氏，关于她的传说我就不用说了吧。呵呵，从某种意义上来说，她是“石头”的母亲。"

character[290] = "万儿"
profile[290] = "其实是卐儿，在19回和茗烟行云雨之事，被宝玉撞见，吓得逃跑了的那个丫头。可怜茗烟“连他的岁属也不问问，别的自然越发不知了。可见他白认得你了。可怜，可怜”。"
 
character[291] = "万虚"
profile[291] = "“总理虚无寂静教门僧录司正堂万虚”“僧录司”是主管僧人的最高官署，“正堂万虚”是总管和尚的叫万虚的总头目。"

character[292] = "王成"
profile[292] = "狗儿的爸爸，板儿的爷爷，其父与王家“因贪王家的势利，便连了宗认作侄儿。”所以才有刘姥姥进贾府。"
sexflag[292] = 1;

character[293] = "王短腿"
profile[293] = "是个马贩子。因为腿短，所以要骑马，因为骑马多了，熟悉马的行情了，所以就开始卖马了，呵呵，瞎掰。"
sexflag[293] = 1;

character[294] = "王济仁"
profile[294] = "也就是书中的王太医，31回为袭人治病，42回为贾母治病，51、52、53回为晴雯治病，57回为宝玉治病。可惜在69回“王太医亦谋干了军前效力，回来好讨荫封的”，小厮们找不到他只好请了个胡太医给尤二姐看病，否则二姐也不一定去的那么早了，sigh。"
sexflag[294] = 1;
mainflag[294] = 1;

character[295] = "王君效"
profile[295] = "“太医院正堂王君效”，是王济仁的叔祖，这里的“正堂”，我的理解应该是主治医生，呵呵。可见他们是个医药世家，医术也是极好的，能让贾母念念不忘。"
sexflag[295] = 1;

character[296] = "王老爷"
profile[296] = "第4回，贾雨村和门子在密室密谈的时候，忽然有人来报“王老爷来拜”，其他不可考。"
sexflag[296] = 1;


character[297] = "王嬷嬷"
profile[297] = "黛玉自幼的奶娘，黛玉到贾府带的两人之一，到了贾府，贾母嫌她老了，因此又派了鹦哥给黛玉。"

character[298] = "王奶奶"
profile[298] = "卜世仁的对门邻居，贾芸去卜世仁处借钱，卜世仁之妻打发她女儿去王奶奶处借钱，呵呵，以此来告诉贾芸，我们家也没钱。"

character[299] = "神瑛侍者"
profile[299]= "“赤瑕宫神瑛侍者，日以甘露灌溉”，宝玉的前身。"
mainflag[299] = 1;
sexflag[299] = 1;

character[300] = "王短腿"
profile[300] = "是个马贩子。因为腿短，所以要骑马，因为骑马多了，熟悉马的行情了，所以就开始卖马了，呵呵，瞎掰。"
sexflag[300] = 1;

